CalcSOAP_JSONJSON_Car/uncompressed/Seq_Add_JSONJSON/Seq_Add_JSONJSON.xml

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="Seq_Add_JSONJSON" xmlns="http://ws.apache.org/ns/synapse">
    <log level="custom">
        <property name="Separator1" value="********** inSequence: BEGIN PROCESSING **********"/>
        <property name="Separator2" value="********** print intA, intB comming with the requestToWSO2 **********"/>
    </log>
    <log level="full">
        <property expression="json-eval($.intA)" name="intA" xmlns:ns="http://org.apache.synapse/xsd"/>
        <property expression="json-eval($.intB)" name="intB" xmlns:ns="http://org.apache.synapse/xsd"/>
    </log>
    <payloadFactory media-type="xml">
        <format>
            <soap:Envelope
                xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
                xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <soap:Body>
                    <Add xmlns="http://tempuri.org/">
                        <intA>$1</intA>
                        <intB>$2</intB>
                    </Add>
                </soap:Body>
            </soap:Envelope>
        </format>
        <args>
            <arg evaluator="json" expression="$.intA" literal="false"/>
            <arg evaluator="json" expression="$.intB" literal="false"/>
        </args>
    </payloadFactory>
    <property name="MESSAGE_TYPE" scope="axis2" type="STRING" value="text/xml; charset=utf-8"/>
    <log level="custom">
        <property name="Separator3" value="********** print payloadFactory results after converting json to xml **********"/>
    </log>
    <log level="full">
        <property expression="$body" name="Result" xmlns:ns="http://org.apache.synapse/xsd"/>
    </log>
    <send>
        <endpoint key="EP_AddSOAP_JSONJSON"/>
    </send>
</sequence>

